{"pageProps":{"meta":{"title":"WASM/EVM Contract Engineer","description":"We are looking for WASM/EVM Contract Engineer here at Edgeware. Join our growing community and help build awesome things!"},"job":{"content":"<h2>Role</h2>\n<p>The WASM/EVM contracts engineer role is a full-stack blockchain role. It involves familiarising oneself with two different smart contracting environments and becoming proficient in developing, deploying, and communicating the \"how-to\"s of smart contracts in both EVM and WASM environments to developers within the Edgeware community. This engineer should become proficient in both using the web3js and PolkadotJS API for interacting with contracts on each respective contracting engine as well as learn the internals of each contracting engine to diagnose and determine low-level configurations for these systems.</p>\n<p>This engineer (whether now or through training):</p>\n<ul>\n<li>Should be able to run Edgeware blockchain and its testnets under various configurations.</li>\n<li>Should be able to integrate pallet-evm, pallet-ethereum, and Frontier into a runtime and run local testnets.</li>\n<li>Should be able to actively monitor changes to upstream contracts and EVM modules, Frontier, and any new projects that spin up around using EVM/WASM contracts on Substrate.</li>\n<li>Should be able to develop technical solutions and tooling around EVM/WASM contracts, through integrating popular ethereum libraries with Edgeware or scripts for improving the developer experience of either contracting engine.</li>\n<li>Should be able to answer high-level research questions and improve the configuration of both modules (gas prices, economics, etc.)</li>\n</ul>\n<h2>Details</h2>\n<p>The main areas of interest for this engineer are:</p>\n<ul>\n<li>Track progress in both EVM/WASM work on Substrate and other projects and compile reports around large changes in their functionality.</li>\n<li>Develop demos &#x26; tutorials for popular and interesting smart contracts in both EVM and WASM contracting languages.</li>\n<li>Propose and implement tooling for improving the developer experience.</li>\n<li>Benchmark contracts on both contracting engines and write reports around the results.\n<ul>\n<li>Reason about gas costs, storage costs, and the differences that manifest when deploying roughly similar contracts on each contracting engine</li>\n</ul>\n</li>\n<li>Research concepts and improvements to these contracting engines, around state rent, upgradability, and more.\n<ul>\n<li>Write articles around these improvements.</li>\n</ul>\n</li>\n</ul>\n","data":{"title":"WASM/EVM Contract Engineer","role":"Edgeware Agency","published":true,"slug":"wasm-evm-contract-engineer"}}},"__N_SSG":true}